INSERT INTO
    users (
        role,
        login,
        nickname,
        hashed_password
    )
VALUES
    -- Администраторы
    (
        'admin',
        'admin_main',
        'Главраг',
        '$2b$12$EixZaYVK1V6M1k73uQz1O.7W42vX9W6i6K6F7b8c9d0e1f2g3h4i5'
    ),
    (
        'admin',
        'moderator_01',
        'Следопыт',
        '$2b$12$KixZaYVK1V6M1k73uQz1O.7W42vX9W6i6K6F7b8c9d0e1f2g3h4i6'
    ),
    (
        'user',
        'alex_smith',
        'Алекс',
        '$2b$12$MixZaYVK1V6M1k73uQz1O.7W42vX9W6i6K6F7b8c9d0e1f2g3h4i7'
    ),
    (
        'user',
        'elena_book',
        'Книголюб',
        '$2b$12$NixZaYVK1V6M1k73uQz1O.7W42vX9W6i6K6F7b8c9d0e1f2g3h4i8'
    ),
    (
        'user',
        'reader_99',
        'Чтец Снов',
        '$2b$12$OixZaYVK1V6M1k73uQz1O.7W42vX9W6i6K6F7b8c9d0e1f2g3h4i9'
    );

INSERT INTO
    books (
        author_id,
        title,
        description,
        published_at
    )
VALUES (
        3,
        'Путь магии',
        'Захватывающее фэнтези о молодом волшебнике.',
        '2026-01-15'
    ),
    (
        3,
        'Темный Лес',
        'Продолжение приключений в неизведанных землях.',
        '2026-05-20'
    ),
    (
        4,
        'Академия теней',
        'Детективный роман в антураже магической школы.',
        '2025-11-02'
    ),
    (
        5,
        'Хроники киберпанка',
        'Антиутопия о мире корпораций и неоновых улиц.',
        '2026-07-01'
    );

INSERT INTO
    genres (name)
VALUES ('Фэнтези'),
    ('Приключения'),
    ('Детектив'),
    ('Киберпанк'),
    ('Антиутопия'),
    ('Научная фантастика'),
    ('Триллер'),
    ('Драма');

INSERT INTO
    book_to_genre (book_id, genre_id)
VALUES (1, 1),
    (1, 2),
    (2, 1),
    (2, 2),
    (2, 7),
    (3, 1),
    (3, 3),
    (4, 4),
    (4, 5),
    (4, 6);

INSERT INTO
    tags (name)
VALUES ('Магическая академия'),
    ('Магия'),
    ('Волшебники'),
    ('Тайна'),
    ('Тёмный лес'),
    ('Путешествия'),
    ('Искусственный интеллект'),
    ('Корпорации'),
    ('Неоновый город'),
    ('Хакеры'),
    ('Становление героя'),
    ('Древние артефакты');

INSERT INTO
    book_to_tag (book_id, tag_id)
VALUES (1, 1),
    (1, 2),
    (1, 3),
    (1, 11),
    (1, 12),
    (2, 5),
    (2, 6),
    (2, 2),
    (2, 4),
    (3, 1),
    (3, 2),
    (3, 4),
    (4, 7),
    (4, 8),
    (4, 9),
    (4, 10);

INSERT INTO
    sections (
        id,
        book_id,
        is_default,
        previous_section,
        title
    )
VALUES (
        1,
        1,
        TRUE,
        NULL,
        'Пролог: Письмо из академии'
    ), -- дефолтный старт ✅
    (
        2,
        1,
        FALSE,
        NULL,
        'Альтернатива: Побег из дома'
    ),
    (
        3,
        1,
        TRUE,
        1,
        'Прибытие в Академию Света'
    ), -- по умолчанию из 1
    (
        4,
        1,
        FALSE,
        1,
        'Тайный вход через подземелья'
    ),
    (
        5,
        1,
        TRUE,
        3,
        'Первый урок магии'
    ), -- по умолчанию из 3
    (
        6,
        1,
        FALSE,
        3,
        'Исследование древней библиотеки'
    ),
    (
        7,
        1,
        TRUE,
        4,
        'Встреча с таинственным наставником'
    ),
    (
        8,
        1,
        TRUE,
        5,
        'Пробуждение древней силы'
    ),
    (
        9,
        2,
        TRUE,
        NULL,
        'Вход в Тёмный Лес'
    ), -- дефолтный старт ✅
    (
        10,
        2,
        TRUE,
        9,
        'Тропа к старому дубу'
    ), -- по умолчанию из 9
    (
        11,
        2,
        FALSE,
        9,
        'Тропа вдоль ручья'
    ), -- альтернатива из 9
    (
        12,
        2,
        TRUE,
        10,
        'Логово лесного зверя'
    ), -- по умолчанию из 10
    (
        13,
        2,
        TRUE,
        11,
        'Древняя поляна с артефактом'
    ),
    (
        14,
        3,
        TRUE,
        NULL,
        'Пролог: Исчезновение студента'
    ), -- дефолтный старт ✅
    (
        15,
        3,
        TRUE,
        14,
        'Расследование начинается'
    ), -- продолжение
    (
        16,
        3,
        TRUE,
        15,
        'Разгадка тайны'
    ),
    (
        17,
        4,
        TRUE,
        NULL,
        'Неоновый город'
    ), -- дефолтный старт ✅
    (
        18,
        4,
        TRUE,
        17,
        'Задание от корпорации'
    ), -- продолжение
    (
        19,
        4,
        TRUE,
        18,
        'Взлом главной системы'
    );
-- финал